# Палитры цветов и классификация
PALETTE_HEX = [
    "ff0000", "ff8080", "800000", "804040",
    "ff8000", "ffbf80", "804000", "806040",
    "ffff00", "ffff80", "808000", "808040",
    "80ff00", "bfff80", "408000", "608040",
    "00ff00", "80ff80", "008000", "408040",
    "00ff80", "80ffbf", "008040", "408060",
    "00ffff", "80ffff", "008080", "408080",
    "0080ff", "80bfff", "004080", "406080",
    "0000ff", "8080ff", "000080", "404080",
    "8000ff", "bf80ff", "400080", "604080",
    "ff00ff", "ff80ff", "800080", "804080",
    "ff0080", "ff80bf", "800040", "804060",
    "000000",
    "404040",
    "808080",
    "bfbfbf",
    "ffffff" 
]

COLOR_VISUAL_CLASSES = {
    "Красный": {"bc0e0e"},
    "Коричневый": {"663300"},
    "Розовый": {"ff0080"},
    "Оранжевый": {"f27900"},
    "Желтый": {"f2f20c"},
    "Зеленый": {"009900"},
    "Голубой": {"29cccc"},
    "Темно-голубой": {"008080"},
    "Синий": {"0a4bcc"},
    "Фиолетовый": {"7e17e5"},
    "Маджента": {"ff00ff"},
    "Сиреневый": {"b300b3"},
    "Черный": {"000000"},
    "Темно-серый": {"404040"},
    "Серый": {"808080"},
    "Светло-серый": {"bfbfbf"},
    "Белый": {"f7f7f7"}
}

HEX_TO_CLASS = {}
for cls, hex_set in COLOR_VISUAL_CLASSES.items():
    for hex_color in hex_set:
        HEX_TO_CLASS[hex_color] = cls